---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AssemblyPrecastFreeze
source: html/c812221b-19fd-be87-b127-629874243b97.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AssemblyPrecastFreeze Property

"Disable Precast Updates"

## Syntax (C#)
```csharp
public static ForgeTypeId AssemblyPrecastFreeze { get; }
```